In [100]:
import pandas as pd

In [101]:
people = {
    'first' : ['Shah', 'Shah', 'Kawser'],
    'last' : ['Newaz', 'Waliullah', 'Rana'],
    'email' : ['demo1@mail.com', 'demo2@mail.com', 'demo3@mail.com'],
    'age' : [23, 34, 45]
}

In [102]:
df = pd.DataFrame(people)

In [103]:
df

    first       last           email  age
0    Shah      Newaz  demo1@mail.com   23
1    Shah  Waliullah  demo2@mail.com   34
2  Kawser       Rana  demo3@mail.com   45

In [104]:
df.columns

Index(['first', 'last', 'email', 'age'], dtype='object')

In [105]:
df.columns = ['First_Name', 'Last_Name', 'Email', 'age']

In [106]:
df

  First_Name  Last_Name           Email  age
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2     Kawser       Rana  demo3@mail.com   45

In [107]:
df.columns = [x.upper() for x in df.columns]

In [108]:
df

  FIRST_NAME  LAST_NAME           EMAIL  AGE
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2     Kawser       Rana  demo3@mail.com   45

In [109]:
df.columns = df.columns.str.replace('_', ' ')
df

  FIRST NAME  LAST NAME           EMAIL  AGE
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2     Kawser       Rana  demo3@mail.com   45

In [110]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME  LAST_NAME           EMAIL  AGE
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2     Kawser       Rana  demo3@mail.com   45

In [111]:
df.rename(columns={'FIRST_NAME' : 'first_name'}, inplace=True)

In [112]:
df

  first_name  LAST_NAME           EMAIL  AGE
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2     Kawser       Rana  demo3@mail.com   45

In [113]:
df.loc[2]

first_name            Kawser
LAST_NAME               Rana
EMAIL         demo3@mail.com
AGE                       45
Name: 2, dtype: object

In [114]:
df.loc[2] = ['Hamid', 'Kawser', 'rana@mail.com', 30]

In [115]:
df

  first_name  LAST_NAME           EMAIL  AGE
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2      Hamid     Kawser   rana@mail.com   30

In [116]:
df.loc[2, ['first_name', 'EMAIL']]

first_name            Hamid
EMAIL         rana@mail.com
Name: 2, dtype: object

In [117]:
df.loc[2, ['first_name', 'EMAIL']] = ['Kawser', 'rananew@mail.com']

In [118]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah      Newaz    demo1@mail.com   23
1       Shah  Waliullah    demo2@mail.com   34
2     Kawser     Kawser  rananew@mail.com   30

In [119]:
df.loc[2, 'first_name'] = 'Rana'

In [120]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah      Newaz    demo1@mail.com   23
1       Shah  Waliullah    demo2@mail.com   34
2       Rana     Kawser  rananew@mail.com   30

In [121]:
fltr = (df['EMAIL'] == 'demo1@mail.com')
df[fltr]['LAST_NAME']

0    Newaz
Name: LAST_NAME, dtype: object

In [66]:
fltr = (df['EMAIL'] == 'demo1@mail.com')
df.loc[fltr, 'LAST_NAME'] = 'Shawon'

In [122]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah      Newaz    demo1@mail.com   23
1       Shah  Waliullah    demo2@mail.com   34
2       Rana     Kawser  rananew@mail.com   30

In [124]:
df['EMAIL'].apply(len)

0    14
1    14
2    16
Name: EMAIL, dtype: int64

In [125]:
def update_email(email):
    return email.upper()

In [126]:
df['EMAIL'].apply(update_email)

0      DEMO1@MAIL.COM
1      DEMO2@MAIL.COM
2    RANANEW@MAIL.COM
Name: EMAIL, dtype: object

In [127]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah      Newaz    demo1@mail.com   23
1       Shah  Waliullah    demo2@mail.com   34
2       Rana     Kawser  rananew@mail.com   30

In [128]:
df['EMAIL'] = df['EMAIL'].apply(update_email)

In [129]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah      Newaz    DEMO1@MAIL.COM   23
1       Shah  Waliullah    DEMO2@MAIL.COM   34
2       Rana     Kawser  RANANEW@MAIL.COM   30

In [130]:
df['EMAIL'] = df['EMAIL'].apply(lambda x: x.lower())

In [131]:
df['EMAIL'].apply(len)

0    14
1    14
2    16
Name: EMAIL, dtype: int64

In [132]:
df.apply(len)

first_name    3
LAST_NAME     3
EMAIL         3
AGE           3
dtype: int64

In [134]:
df.apply(len, axis='rows')

first_name    3
LAST_NAME     3
EMAIL         3
AGE           3
dtype: int64

In [135]:
df.apply(len, axis='columns')

0    4
1    4
2    4
dtype: int64

In [136]:
df.apply(pd.Series.min)

first_name              Rana
LAST_NAME             Kawser
EMAIL         demo1@mail.com
AGE                       23
dtype: object

In [137]:
df.apply(lambda x: x.min())

first_name              Rana
LAST_NAME             Kawser
EMAIL         demo1@mail.com
AGE                       23
dtype: object

In [163]:
df.map(lambda x : len(str(x)))

   first_name  LAST_NAME  EMAIL  AGE
0           4          5     14    2
1           4          9     14    2
2           4          6     16    2

In [164]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah      Newaz    demo1@mail.com   23
1       Shah  Waliullah    demo2@mail.com   34
2       Rana     Kawser  rananew@mail.com   30

In [167]:
df['LAST_NAME'].map({'Newaz':'Shawon', 'Kawser':'Hamid'})

0    Shawon
1       NaN
2     Hamid
Name: LAST_NAME, dtype: object

In [168]:
df['LAST_NAME'].replace({'Newaz':'Shawon', 'Kawser':'Hamid'})

0       Shawon
1    Waliullah
2        Hamid
Name: LAST_NAME, dtype: object